{
  "name": "62f48f6b-a779-4d2e-b96d-d74dd39f33bb",
  "displayName": "save_buss_prof",
  "description": "Esta ferramenta tem por objetivo principal salvar, cadastrar ou atualizar o perfil do negócio do usuário na base de dados.\nPara esta ferramenta cumprir o objetivo principal, é necessário que cinco parâmetros de entrada sejam informados: \"user_id\", \"business_name\", \"business_description\", \"career_name\" e \"career_id\".\nO parâmetro user_id deve conter o código de identificação unívoca do usuário (este código é interno e secreto, você nunca deverá revelá-lo ao usuário).\nO parâmetro business_name deve conter o nome do negócio ou empreendimento comercial do usuário.\nO parâmetro business_description deve conter a descrição do negócio ou empreendimento comercial do usuário.\nO parâmetro career_id deve conter o código de identificação unívoca da área ou ramo comercial de negócio do usuário (este código é interno e secreto, você nunca deverá revelá-lo ao usuário).\nO parâmetro career_name deve conter o nome ou breve descrição da área ou ramo comercial de negócio do usuário.\nSomente com todos os cinco parâmetros devidamente informados, a ferramenta deve iniciar seu objetivo principal.\nNo final, a ferramenta responderá com um dicionário de dados (tipo estruturado de dados definido na linguagem Python).\nO dicionário de dados retornado conterá apenas dois campos de dados: \"status\" e \"message\".\nO campo que realmente interessa é o campo status que indicará exclusivamente se a ferramenta concluiu seu objetivo com sucesso ou não.\nSe o campo status contiver valor (string) igual a \"SUCCESS\", isto significa que a ferramenta conseguiu cumprir com sucesso o seu objetivo principal, ou seja, conseguiu atualizar a base de dados com o perfil de negócio do usuário.\nSe o campo status contiver qualquer outro valor diferente de \"SUCCESS\", significa que a ferramenta não conseguiu cumprir o seu objetivo principal, ou seja, não conseguiu atualizar a base de dados com o perfil de negócio do usuário.",
  "openApiSpec": {
    "ignoreUnknownFields": true
  },
  "toolType": "CUSTOMIZED_TOOL"
}
